Microchip-MPLAB-Harmony/net/apps/tcpip_tcp_server_bridge/firmware/src/config/pic32mz_ef_sk_encx24j600/driver/encx24j600/src/dynamic/drv_encx24j600_ds_defs.h
/*******************************************************************************
 ENCX24J600 Data Sheet Definitions.
  Company:
    Microchip Technology Inc.
    
  File Name:
    DRV_ENCX24J600_DS_DEFS.h
  Summary:
    
  Description:
*******************************************************************************/
// DOM-IGNORE-BEGIN
/*****************************************************************************
 Copyright (C) 2014-2018 Microchip Technology Inc. and its subsidiaries.

Microchip Technology Inc. and its subsidiaries.

Subject to your compliance with these terms, you may use Microchip software 
and any derivatives exclusively with Microchip products. It is your 
responsibility to comply with third party license terms applicable to your 
use of third party software (including open source software) that may 
accompany Microchip software.

THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR 
PURPOSE.

IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE 
FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN 
ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY, 
THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
*****************************************************************************/

// DOM-IGNORE-END
#if !defined(MCHP_9AF9E982_4FC2_44a4_B2D8_34A7D80A51EA__INCLUDED_)
#define MCHP_9AF9E982_4FC2_44a4_B2D8_34A7D80A51EA__INCLUDED_


#ifdef __cplusplus
extern "C" {
#endif

#include "system_config.h"

#define DRV_ENCX24J600_MEM_SIZE 0x6000

typedef struct _DRV_ENCX24J600_RD_ECON1
{
	uint8_t RXEN:1;
	uint8_t TXRTS:1;
	uint8_t DMANOCS:1;
	uint8_t DMACSSD:1;
	uint8_t DMACPY:1;
	uint8_t DMAST:1;
	uint8_t FCOP:2;
	uint8_t PKTDEC:1;
	uint8_t AESOP:2;
	uint8_t AESST:1;
	uint8_t HASHLST:1;
	uint8_t HASHOP:1;
	uint8_t HASHEN:1;
	uint8_t MODEXST:1;
}  DRV_ENCX24J600_RD_ECON1;


typedef struct _DRV_ENCX24J600_RD_ECON2
{
	uint8_t AESLEN:2;
	uint8_t MODLEN:2;
	uint8_t ETHRST:1;
	uint8_t RXRST:1;
	uint8_t TXRST:1;
	uint8_t AUTOFC:1;
	uint8_t COCON:4;
	uint8_t SHA1MD5:1;
	uint8_t TXMAC:1;
	uint8_t STRCH:1;
	uint8_t ETHEN:1;
}  DRV_ENCX24J600_RD_ECON2;


typedef struct _DRV_ENCX24J600_RD_EDMACS
{
	uint16_t EDMACS;
}  DRV_ENCX24J600_RD_EDMACS;


typedef struct _DRV_ENCX24J600_RD_EDMALEN
{
	uint16_t EDMALEN:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EDMALEN;


typedef struct _DRV_ENCX24J600_RD_EDMAST
{
	uint16_t EDMAST:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EDMAST;


typedef struct _DRV_ENCX24J600_RD_EGPDATA
{
	uint8_t EGPDATA;
	uint8_t :8;
}  DRV_ENCX24J600_RD_EGPDATA;


typedef struct _DRV_ENCX24J600_RD_EGPRDPT
{
	uint16_t EGPRDPT:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EGPRDPT;


typedef struct _DRV_ENCX24J600_RD_EGPWRPT
{
	uint16_t EGPWRPT:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EGPWRPT;


typedef struct _DRV_ENCX24J600_RD_EHT1
{
	uint16_t EHT1;
}  DRV_ENCX24J600_RD_EHT1;


typedef struct _DRV_ENCX24J600_RD_EHT2
{
	uint16_t EHT2;
}  DRV_ENCX24J600_RD_EHT2;


typedef struct _DRV_ENCX24J600_RD_EHT3
{
	uint16_t EHT3;
}  DRV_ENCX24J600_RD_EHT3;


typedef struct _DRV_ENCX24J600_RD_EHT4
{
	uint16_t EHT4;
}  DRV_ENCX24J600_RD_EHT4;


typedef struct _DRV_ENCX24J600_RD_EIDLED
{
	uint8_t REVID:5;
	uint8_t DEVID:3;
	uint8_t LBCFG:4;
	uint8_t LACFG:4;
}  DRV_ENCX24J600_RD_EIDLED;


typedef struct _DRV_ENCX24J600_RD_EIE
{
	/**
	 * <b>PCFULIE: </b>Packet Counter Full Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t PCFULIE:1;
	/**
	 * <b>RXABTIE: </b>Receive Abort Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t RXABTIE:1;
	/**
	 * <b>TXABTIE: </b>Transmit Abort Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t TXABTIE:1;
	/**
	 * <b>TXIE: </b>Transmit Done Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t TXIE:1;
	/**
	 * <b>Reserved: </b>Ignore on read, don't care on write<b>(1)</b>
	 */
	uint8_t :1;
	/**
	 * <b>DMAIE: </b>DMA Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t DMAIE:1;
	/**
	 * <b>PKTIE: </b>RX Packet Pending Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t PKTIE:1;
	/**
	 * <b>Reserved: </b>Write as '0'
	 */
	uint8_t :1;
	uint8_t :3;
	/**
	 * <b>LINKIE: </b>PHY Link Status Change Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t LINKIE:1;
	/**
	 * <b>AESIE: </b>AES Encrypt/Decrypt Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t AESIE:1;
	/**
	 * <b>HASHIE: </b>MD5/SHA-1 Hash Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t HASHIE:1;
	/**
	 * <b>MODEXIE: </b>Modular Exponentiation Interrupt Enable bit
	 * 1 = Enabled
	 * 0 = Disabled
	 */
	uint8_t MODEXIE:1;
	/**
	 * <b>INTIE: </b>INT Global Interrupt Enable bit
	 * 1 = INT pin is controlled by the INT status bit (ESTAT<15>)
	 * 0 = INT pin is driven high
	 */
	uint8_t INTIE:1;
}  DRV_ENCX24J600_RD_EIE;


typedef struct _DRV_ENCX24J600_RD_EIR
{
	/**
	 * <b>PCFULIF: </b>Packet Counter Full Interrupt Flag bit
	 * 1 = PKTCNT field has reached FFh. Software must decrement the packet counter to
	 * prevent the next RX packet from being dropped.
	 * 0 = No interrupt pending
	 */
	uint8_t PCFULIF:1;
	/**
	 * <b>RXABTIF: </b>Receive Abort Interrupt Flag bit
	 * 1 = An RX packet was dropped because there is insufficient space in the RX
	 * buffer to store the complete packet or the PKTCNT field is saturated at FFh
	 * 0 = No interrupt pending
	 */
	uint8_t RXABTIF:1;
	/**
	 * <b>TXABTIF: </b>Transmit Abort Interrupt Flag bit
	 * 1 = Packet transmission has been aborted due to an error. Read the ETXSTAT
	 * register to determine the cause. TXRTS (ECON1<1>) has been cleared by hardware.
	 * 
	 * 0 = No interrupt pending
	 */
	uint8_t TXABTIF:1;
	/**
	 * <b>TXIF: </b>Transmit Done Interrupt Flag bit
	 * 1 = Packet transmission has completed. TXRTS (ECON1<1>) has been cleared by
	 * hardware.
	 * 0 = No interrupt pending
	 */
	uint8_t TXIF:1;
	/**
	 * <b>Reserved: </b>Ignore on read, don't care on write
	 */
	uint8_t :1;
	/**
	 * <b>DMAIF: </b>DMA Interrupt Flag bit
	 * 1 = DMA copy or checksum operation is complete
	 * 0 = No interrupt pending
	 */
	uint8_t DMAIF:1;
	/**
	 * <b>PKTIF: </b>RX Packet Pending Interrupt Flag bit
	 * 1 = One or more RX packets have been saved and are ready for software
	 * processing. The
	 * PKTCNT<7:0> (ESTAT<7:0>) bits are non-zero. To clear this flag, decrement the
	 * PKTCNT bits to zero by setting PKTDEC (ECON1<8>).
	 * 0 = No RX packets are pending
	 */
	uint8_t PKTIF:1;
	/**
	 * <b>Reserved: </b>Ignore on read, don't care on write
	 */
	uint8_t :1;
	uint8_t :3;
	/**
	 * <b>LINKIF: </b>PHY Link Status Change Interrupt Flag bit
	 * 1 = PHY Ethernet link status has changed. Read PHYLNK (ESTAT<8>) to determine
	 * the current state.
	 * 0 = No interrupt pending
	 */
	uint8_t LINKIF:1;
	/**
	 * <b>AESIF: </b>AES Encrypt/Decrypt Interrupt Flag bit
	 * 1 = AES encrypt/decrypt operation is complete
	 * 0 = No interrupt pending
	 */
	uint8_t AESIF:1;
	/**
	 * <b>HASHIF: </b>MD5/SHA-1 Hash Interrupt Flag bit
	 * 1 = MD5/SHA-1 hash operation is complete
	 * 0 = No interrupt pending
	 */
	uint8_t HASHIF:1;
	/**
	 * <b>MODEXIF: </b>Modular Exponentiation Interrupt Flag bit
	 * 1 = Modular exponentiation calculation is complete
	 * 0 = No interrupt pending
	 */
	uint8_t MODEXIF:1;
	/**
	 * <b>CRYPTEN</b>: Modular Exponentiation and AES Cryptographic Modules Enable
	 * bit
	 * 1 = All cryptographic engine modules are enabled
	 * 0 = Modular exponentiation and AES modules are disabled and powered down;
	 * MD5/SHA-1 hashing is still available
	 */
	uint8_t CRYPTEN:1;
}  DRV_ENCX24J600_RD_EIR;


