Microchip-MPLAB-Harmony/net/apps/tcpip_tcp_server_bridge/firmware/src/config/pic32mz_ef_sk_encx24j600/driver/encx24j600/src/dynamic/drv_encx24j600_ds_defs.h
typedef struct _DRV_ENCX24J600_RD_EPAUS
{
	uint16_t EPAUS;
}  DRV_ENCX24J600_RD_EPAUS;


typedef struct _DRV_ENCX24J600_RD_EPMCS
{
	uint16_t EPMCS;
}  DRV_ENCX24J600_RD_EPMCS;


typedef struct _DRV_ENCX24J600_RD_EPMM1
{
	uint16_t EPMM1;
}  DRV_ENCX24J600_RD_EPMM1;


typedef struct _DRV_ENCX24J600_RD_EPMM2
{
	uint16_t EPMM2;
}  DRV_ENCX24J600_RD_EPMM2;


typedef struct _DRV_ENCX24J600_RD_EPMM3
{
	uint16_t EPMM3;
}  DRV_ENCX24J600_RD_EPMM3;


typedef struct _DRV_ENCX24J600_RD_EPMM4
{
	uint16_t EPMM4;
}  DRV_ENCX24J600_RD_EPMM4;


typedef struct _DRV_ENCX24J600_RD_EPMO
{
	uint16_t EPMO;
}  DRV_ENCX24J600_RD_EPMO;


typedef struct _DRV_ENCX24J600_RD_ERXDATA
{
	uint8_t ERXDATA;
	uint8_t :8;
}  DRV_ENCX24J600_RD_ERXDATA;


typedef struct _DRV_ENCX24J600_RD_ERXFCON
{
	uint8_t BCEN:1;
	uint8_t MCEN:1;
	uint8_t NOTMEEN:1;
	uint8_t UCEN:1;
	uint8_t RUNTEN:1;
	uint8_t RUNTEEN:1;
	uint8_t CRCEN:1;
	uint8_t CRCEEN:1;
	uint8_t PMEN:4;
	uint8_t NOTPM:1;
	uint8_t :1;
	uint8_t MPEN:1;
	uint8_t HTEN:1;
}  DRV_ENCX24J600_RD_ERXFCON;


typedef struct _DRV_ENCX24J600_RD_ERXHEAD
{
	uint16_t ERXTAIL:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ERXHEAD;


typedef struct _DRV_ENCX24J600_RD_ERXRDPT
{
	uint16_t ERXRDPT:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ERXRDPT;


typedef struct _DRV_ENCX24J600_RD_ERXST
{
	uint16_t ERXST:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ERXST;


typedef struct _DRV_ENCX24J600_RD_ERXTAIL
{
	uint16_t ERXTAIL:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ERXTAIL;


typedef struct _DRV_ENCX24J600_RD_ERXWM
{
	uint8_t RXEWM;
	uint8_t RXFWM;
}  DRV_ENCX24J600_RD_ERXWM;


typedef struct _DRV_ENCX24J600_RD_ERXWRPT
{
	uint16_t ERXWRPT:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ERXWRPT;


typedef struct _DRV_ENCX24J600_RD_ESTAT
{
	uint8_t PKTCNT:8;
	uint8_t PHYLNK:1;
	uint8_t :1;
	uint8_t PHYDPX:1;
	uint8_t :1;
	uint8_t CLKRDY:1;
	uint8_t RXBUSY:1;
	uint8_t FCIDLE:1;
	uint8_t INT:1;
}  DRV_ENCX24J600_RD_ESTAT;


typedef struct _DRV_ENCX24J600_RD_ETXLEN
{
	uint16_t ETXLEN:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ETXLEN;


typedef struct _DRV_ENCX24J600_RD_ETXST
{
	uint16_t ETXST:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_ETXST;


typedef struct _DRV_ENCX24J600_RD_ETXSTAT
{
	uint8_t COLCNT:4;
	uint8_t CRCBAD:1;
	uint8_t :2;
	uint8_t DEFER:1;
	uint8_t EXDEFER:1;
	uint8_t MAXCOL:1;
	uint8_t LATECOL:1;
	uint8_t :5;
}  DRV_ENCX24J600_RD_ETXSTAT;


typedef struct _DRV_ENCX24J600_RD_ETXWIRE
{
	uint16_t ETXWIRE;
}  DRV_ENCX24J600_RD_ETXWIRE;


typedef struct _DRV_ENCX24J600_RD_EUDADATA
{
	uint8_t EUDADATA;
	uint8_t :8;
}  DRV_ENCX24J600_RD_EUDADATA;


typedef struct _DRV_ENCX24J600_RD_EUDAND
{
	uint16_t EUDAND:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EUDAND;


typedef struct _DRV_ENCX24J600_RD_EUDARDPT
{
	uint16_t EUDARDPT:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EUDARDPT;


typedef struct _DRV_ENCX24J600_RD_EUDAST
{
	uint16_t EUDAST:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EUDAST;


typedef struct _DRV_ENCX24J600_RD_EUDAWRPT
{
	uint16_t EUDAWRPT:15;
	uint8_t :1;
}  DRV_ENCX24J600_RD_EUDAWRPT;


typedef struct _DRV_ENCX24J600_RD_MAADR1
{
	uint16_t MAADR1;
}  DRV_ENCX24J600_RD_MAADR1;


typedef struct _DRV_ENCX24J600_RD_MAADR2
{
	uint16_t MAADR2;
}  DRV_ENCX24J600_RD_MAADR2;


typedef struct _DRV_ENCX24J600_RD_MAADR3
{
	uint16_t MAADR3;
}  DRV_ENCX24J600_RD_MAADR3;


typedef struct _DRV_ENCX24J600_RD_MABBIPG
{
	uint8_t BBIPG:7;
	uint16_t :9;
}  DRV_ENCX24J600_RD_MABBIPG;


typedef struct _DRV_ENCX24J600_RD_MACLCON
{
	uint8_t MAXRET:4;
	uint16_t :12;
}  DRV_ENCX24J600_RD_MACLCON;


typedef struct _DRV_ENCX24J600_RD_MACON1
{
	uint8_t :1;
	uint8_t PASSALL:1;
	uint8_t RXPAUS:1;
	uint8_t :1;
	uint8_t LOOPBK:1;
	uint16_t :11;
}  DRV_ENCX24J600_RD_MACON1;


typedef struct _DRV_ENCX24J600_RD_MACON2
{
	uint8_t FULDPX:1;
	uint8_t :1;
	uint8_t HFRMEN:1;
	uint8_t PHDREN:1;
	uint8_t TXCRCEN:1;
	uint8_t PADCFG:3;
	uint8_t :4;
	uint8_t NOBKOFF:1;
	uint8_t BPEN:1;
	uint8_t DEFER:1;
	uint8_t :1;
}  DRV_ENCX24J600_RD_MACON2;


typedef struct _DRV_ENCX24J600_RD_MAIPG
{
	uint8_t IPG:7;
	uint16_t :9;
}  DRV_ENCX24J600_RD_MAIPG;


typedef struct _DRV_ENCX24J600_RD_MAMXFL
{
	uint16_t MAMXFL;
}  DRV_ENCX24J600_RD_MAMXFL;


typedef struct _DRV_ENCX24J600_RD_MICMD
{
	uint8_t MIIRD:1;
	uint8_t MIISCAN:1;
	uint16_t :14;
}  DRV_ENCX24J600_RD_MICMD;


typedef struct _DRV_ENCX24J600_RD_MIRD
{
	uint16_t MIRD;
}  DRV_ENCX24J600_RD_MIRD;


typedef struct _DRV_ENCX24J600_RD_MIREGADR
{
	uint8_t PHREG:5;
	uint8_t :3;
	uint8_t writeAsOne:1;
	uint8_t :7;
}  DRV_ENCX24J600_RD_MIREGADR;


typedef struct _DRV_ENCX24J600_RD_MISTAT
{
	uint8_t BUSY:1;
	uint8_t SCAN:1;
	uint8_t NVALID:1;
	uint16_t :13;
}  DRV_ENCX24J600_RD_MISTAT;


typedef struct _DRV_ENCX24J600_RD_MIWR
{
	uint16_t MIWR;
}  DRV_ENCX24J600_RD_MIWR;


typedef struct _DRV_ENCX24J600_RD_PHANA
{
	uint8_t ADIEEE:5;
	uint8_t AD10:1;
	uint8_t AD10FD:1;
	uint8_t AD100:1;
	uint8_t AD100FD:1;
	uint8_t __unnamed_9:1;
	uint8_t ADPAUS:2;
	uint8_t __unnamed_12:1;
	uint8_t ADFAULT:1;
	uint8_t __unnamed_14:1;
	uint8_t ADNP:1;
}  DRV_ENCX24J600_RD_PHANA;


typedef struct _DRV_ENCX24J600_RD_PHANE
{
	uint8_t LPANABL:1;
	uint8_t LPAPCD:1;
	uint8_t :2;
	uint8_t PDFLT:1;
	uint16_t :11;
}  DRV_ENCX24J600_RD_PHANE;


typedef struct _DRV_ENCX24J600_RD_PHANLPA
{
	uint8_t LPIEEE:5;
	uint8_t LP10:1;
	uint8_t LP10FD:1;
	uint8_t LP100:1;
	uint8_t LP100FD:1;
	uint8_t LP100T4:1;
	uint8_t LPPAUS:2;
	uint8_t :1;
	uint8_t LPFAULT:1;
	uint8_t LPACK:1;
	uint8_t LPNP:1;
}  DRV_ENCX24J600_RD_PHANLPA;


typedef struct _DRV_ENCX24J600_RD_PHCON1
{
	uint8_t :8;
	uint8_t PFULDPX:1;
	uint8_t REGNEG:1;
	uint8_t :1;
	uint8_t PSLEEP:1;
	uint8_t ANEN:1;
	uint8_t SPD100:1;
	uint8_t PLOOPBK:1;
	uint8_t PRST:1;
}  DRV_ENCX24J600_RD_PHCON1;


typedef struct _DRV_ENCX24J600_RD_PHCON2
{
	uint8_t :1;
	uint8_t EDSTAT:1;
	uint8_t FRCLNK:1;
	uint8_t :8;
	uint8_t EDTHRES:1;
	uint8_t :1;
	uint8_t EDPWRDN:1;
	uint8_t :2;
}  DRV_ENCX24J600_RD_PHCON2;


