Microchip-MPLAB-Harmony/net/apps/tcpip_tcp_server_bridge/firmware/src/config/pic32mz_ef_sk_encx24j600/driver/encx24j600/src/dynamic/drv_encx24j600_ds_defs.h
typedef struct _DRV_ENCX24J600_RD_PHSTAT1
{
	uint8_t EXTREGS:1;
	uint8_t :1;
	uint8_t LLSTAT:1;
	uint8_t ANABLE:1;
	uint8_t LRFAULT:1;
	uint8_t ANDONE:1;
	uint8_t :5;
	uint8_t HALF10:1;
	uint8_t FULL10:1;
	uint8_t HALF100:1;
	uint8_t FULL100:1;
	uint8_t :1;
}  DRV_ENCX24J600_RD_PHSTAT1;


typedef struct _DRV_ENCX24J600_RD_PHSTAT2
{
	uint8_t :4;
	uint8_t PLRITY:1;
	uint16_t :11;
}  DRV_ENCX24J600_RD_PHSTAT2;


typedef struct _DRV_ENCX24J600_RD_PHSTAT3
{
	uint8_t :2;
	uint8_t SPDDPX:3;
	uint16_t :11;
}  DRV_ENCX24J600_RD_PHSTAT3;


typedef union _DRV_ENCX24J600_RegUnion
{
	uint16_t value;
	DRV_ENCX24J600_RD_ECON1 econ1;
	DRV_ENCX24J600_RD_ECON2 econ2;
	DRV_ENCX24J600_RD_EDMALEN edmalen;
	DRV_ENCX24J600_RD_EDMACS edmacs;
	DRV_ENCX24J600_RD_EDMAST edmast;
	DRV_ENCX24J600_RD_EGPDATA egpdata;
	DRV_ENCX24J600_RD_EGPRDPT egprdpt;
	DRV_ENCX24J600_RD_EGPWRPT egpwrpt;
	DRV_ENCX24J600_RD_EHT1 eht1;
	DRV_ENCX24J600_RD_EIR eir;
	DRV_ENCX24J600_RD_EPAUS epaus;
	DRV_ENCX24J600_RD_EPMCS epmcs;
	DRV_ENCX24J600_RD_EPMM1 epmm1;
	DRV_ENCX24J600_RD_EPMM2 epmm2;
	DRV_ENCX24J600_RD_EPMM3 epmm3;
	DRV_ENCX24J600_RD_EHT2 eht2;
	DRV_ENCX24J600_RD_EHT3 eht3;
	DRV_ENCX24J600_RD_EHT4 eht4;
	DRV_ENCX24J600_RD_EIDLED eidled;
	DRV_ENCX24J600_RD_EIE eie;
	DRV_ENCX24J600_RD_EPMM4 epmm4;
	DRV_ENCX24J600_RD_EPMO epmo;
	DRV_ENCX24J600_RD_ERXDATA erxdata;
	DRV_ENCX24J600_RD_ERXFCON erxfcon;
	DRV_ENCX24J600_RD_ERXHEAD erxhead;
	DRV_ENCX24J600_RD_ERXRDPT erxrdpt;
	DRV_ENCX24J600_RD_ERXST erxst;
	DRV_ENCX24J600_RD_ERXTAIL erxtail;
	DRV_ENCX24J600_RD_ERXWM erxwm;
	DRV_ENCX24J600_RD_ERXWRPT erxwrpt;
	DRV_ENCX24J600_RD_EUDADATA eudadata;
	DRV_ENCX24J600_RD_EUDAND eudand;
	DRV_ENCX24J600_RD_EUDARDPT eudardpt;
	DRV_ENCX24J600_RD_EUDAST eudast;
	DRV_ENCX24J600_RD_EUDAWRPT eudawrpt;
	DRV_ENCX24J600_RD_MAADR1 maadr1;
	DRV_ENCX24J600_RD_MAADR2 maadr2;
	DRV_ENCX24J600_RD_MAADR3 maadr3;
	DRV_ENCX24J600_RD_MABBIPG mabbipg;
	DRV_ENCX24J600_RD_MACLCON maclcon;
	DRV_ENCX24J600_RD_MIRD mird;
	DRV_ENCX24J600_RD_MIREGADR miregadr;
	DRV_ENCX24J600_RD_MISTAT mistat;
	DRV_ENCX24J600_RD_MIWR miwr;
	DRV_ENCX24J600_RD_PHANA phana;
	DRV_ENCX24J600_RD_PHSTAT1 phstat1;
	DRV_ENCX24J600_RD_PHSTAT2 phstat2;
	DRV_ENCX24J600_RD_PHSTAT3 phstat3;
	DRV_ENCX24J600_RD_ESTAT estat;
	DRV_ENCX24J600_RD_ETXLEN etxlen;
	DRV_ENCX24J600_RD_ETXST etxst;
	DRV_ENCX24J600_RD_ETXSTAT etxstat;
	DRV_ENCX24J600_RD_ETXWIRE etxwire;
	DRV_ENCX24J600_RD_MACON1 macon1;
	DRV_ENCX24J600_RD_MACON2 macon2;
	DRV_ENCX24J600_RD_MAIPG maipg;
	DRV_ENCX24J600_RD_MAMXFL mamxfl;
	DRV_ENCX24J600_RD_MICMD micmd;
	DRV_ENCX24J600_RD_PHANE phane;
	DRV_ENCX24J600_RD_PHANLPA phanlpa;
	DRV_ENCX24J600_RD_PHCON1 phcon1;
	DRV_ENCX24J600_RD_PHCON2 phcon2;
}  DRV_ENCX24J600_RegUnion;


typedef struct _DRV_ENCX24J600_RSV
{
	uint16_t pNextPacket:16;
	uint16_t rxByteCount:16;
	uint8_t prevIgnored:1;
	uint8_t :1;
	uint8_t carrierEventPrevSeen:1;
	uint8_t :1;
	uint8_t crcError:1;
	uint8_t lenChkError:1;
	uint8_t lenOutOfRange:1;
	uint8_t rxOk:1;
	uint8_t rxMultcast:1;
	uint8_t rxBcast:1;
	uint8_t dribbleNibble:1;
	uint8_t rxCtrlFrm:1;
	uint8_t rxPauseCtrlFrm:1;
	uint8_t rxUkwnOpCode:1;
	uint8_t rxVLAN:1;
	uint8_t runtFltrMtch:1;
	uint8_t notMeFltrMtch:1;
	uint8_t hashFltrMtch:1;
	uint8_t magicPktFltrMtch:1;
	uint8_t patternFltrMtch:1;
	uint8_t unicastFltrMtch:1;
	uint16_t :11;
}  DRV_ENCx24J600_RSV;


typedef enum
{
	DRV_ENCX24J600_PHY_SFR_PHCON1 = 0x00,
	DRV_ENCX24J600_PHY_SFR_PHSTAT1 = 0x01,
	DRV_ENCX24J600_PHY_SFR_PHANA = 0x04,
	DRV_ENCX24J600_PHY_SFR_PHANLPA = 0x05,
	DRV_ENCX24J600_PHY_SFR_PHANE = 0x06,
	DRV_ENCX24J600_PHY_SFR_PHCON2 = 0x11,
	DRV_ENCX24J600_PHY_SFR_PHSTAT2 = 0x1B,
	DRV_ENCX24J600_PHY_SFR_PHSTAT3 = 0x1F
} DRV_ENCX24J600_PHY_SFR_MAP;

typedef enum
{
	DRV_ENCX24J600_SFR_ETXS,
	DRV_ENCX24J600_SFR_ETXLEN,
	DRV_ENCX24J600_SFR_ERXST,
	DRV_ENCX24J600_SFR_ERXTAIL,
	DRV_ENCX24J600_SFR_ERXHEAD,
	DRV_ENCX24J600_SFR_EDMAST,
	DRV_ENCX24J600_SFR_EDMALEN,
	DRV_ENCX24J600_SFR_EDMADST,
	DRV_ENCX24J600_SFR_EDMACS,
	DRV_ENCX24J600_SFR_ETXSTAT,
	DRV_ENCX24J600_SFR_ETXWIRE,
	DRV_ENCX24J600_SFR_EUDAST,
	DRV_ENCX24J600_SFR_EUDAND,
	DRV_ENCX24J600_SFR_ESTAT,
	DRV_ENCX24J600_SFR_EIR,
	DRV_ENCX24J600_SFR_ECON1,
	DRV_ENCX24J600_SFR_EHT1,
	DRV_ENCX24J600_SFR_EHT2,
	DRV_ENCX24J600_SFR_EHT3,
	DRV_ENCX24J600_SFR_EHT4,
	DRV_ENCX24J600_SFR_EPMM1,
	DRV_ENCX24J600_SFR_EPMM2,
	DRV_ENCX24J600_SFR_EPMM3,
	DRV_ENCX24J600_SFR_EPMM4,
	DRV_ENCX24J600_SFR_EPMCS,
	DRV_ENCX24J600_SFR_EPMO,
	DRV_ENCX24J600_SFR_ERXFCON,
	DRV_ENCX24J600_SFR_MACON1,
	DRV_ENCX24J600_SFR_MACON2,
	DRV_ENCX24J600_SFR_MABBIPG,
	DRV_ENCX24J600_SFR_MAIPG,
	DRV_ENCX24J600_SFR_MACLCON,
	DRV_ENCX24J600_SFR_MAMXFL,
	DRV_ENCX24J600_SFR_MICMD,
	DRV_ENCX24J600_SFR_MIREGADR,
	DRV_ENCX24J600_SFR_MAADR3,
	DRV_ENCX24J600_SFR_MAADR2,
	DRV_ENCX24J600_SFR_MAADR1,
	DRV_ENCX24J600_SFR_MIWR,
	DRV_ENCX24J600_SFR_MIRD,
	DRV_ENCX24J600_SFR_MISTAT,
	DRV_ENCX24J600_SFR_EPAUS,
	DRV_ENCX24J600_SFR_ECON2,
	DRV_ENCX24J600_SFR_ERXWM,
	DRV_ENCX24J600_SFR_EIE,
	DRV_ENCX24J600_SFR_EIDLED,
	DRV_ENCX24J600_SFR_EGPDATA,
	DRV_ENCX24J600_SFR_ERXDATA,
	DRV_ENCX24J600_SFR_EUDADTA,
	DRV_ENCX24J600_SFR_EGPRDPT,
	DRV_ENCX24J600_SFR_EGPWRPT,
	DRV_ENCX24J600_SFR_ERXRDPT,
	DRV_ENCX24J600_SFR_ERXWRPT,
	DRV_ENCX24J600_SFR_EUDARDPT,
	DRV_ENCX24J600_SFR_EUDAWRPT
} DRV_ENCX24J600_SFR_MAP;

typedef enum
{
	/**
	 * Bank 0 Select
	 */
	DRV_ENCX24J600_SPI_INST_B0SEL = 0xC0,
	/**
	 * Bank 1 Select
	 */
	DRV_ENCX24J600_SPI_INST_B1SEL = 0xC2,
	/**
	 * Bank 2 Select
	 */
	DRV_ENCX24J600_SPI_INST_B2SEL = 0xC4,
	/**
	 * Bank 3 Select
	 */
	DRV_ENCX24J600_SPI_INST_B3SEL = 0xC6,
	/**
	 * System Reset
	 */
	DRV_ENCX24J600_SPI_INST_SETETHRST = 0xCA,
	/**
	 * Flow Control Disable
	 */
	DRV_ENCX24J600_SPI_INST_FCDISABLE = 0xE0,
	/**
	 * Flow Control Single
	 */
	DRV_ENCX24J600_SPI_INST_FCSINGLE = 0xE2,
	/**
	 * Flow Control Multiple
	 */
	DRV_ENCX24J600_SPI_INST_FCMULTIPLE = 0xE4,
	/**
	 * Flow Control Clear
	 */
	DRV_ENCX24J600_SPI_INST_FCCLEAR = 0xE6,
	/**
	 * Decrement Packet Counter
	 */
	DRV_ENCX24J600_SPI_INST_SETPKTDEC = 0xCC,
	/**
	 * DMA Stop
	 */
	DRV_ENCX24J600_SPI_INST_DMASTOP = 0xD2,
	/**
	 * DMA Start Checksum
	 */
	DRV_ENCX24J600_SPI_INST_DMACKSUM = 0xD8,
	/**
	 * DMA Start Checksum with Seed
	 */
	DRV_ENCX24J600_SPI_INST_DMACKSUMS = 0xDA,
	/**
	 * DMA Start Copy
	 */
	DRV_ENCX24J600_SPI_INST_DMACOPY = 0xDC,
	/**
	 * DMA Start Copy and Checksum with Seed
	 */
	DRV_ENCX24J600_SPI_INST_DMACOPYS = 0xDE,
	/**
	 * Request Packet Transmission
	 */
	DRV_ENCX24J600_SPI_INST_SETTXRTS = 0xD4,
	/**
	 * Enable RX
	 */
	DRV_ENCX24J600_SPI_INST_ENABLERX = 0xE8,
	/**
	 * Disable RX
	 */
	DRV_ENCX24J600_SPI_INST_DISABLERX = 0xEA,
	/**
	 * Enable Interrupts
	 */
	DRV_ENCX24J600_SPI_INST_SETEIE = 0xEC,
	/**
	 * Disable Interrupts
	 */
	DRV_ENCX24J600_SPI_INST_CLREIE = 0xEE,
	/**
	 * Read Bank Select
	 */
	DRV_ENCX24J600_SPI_INST_RBSEL = 0xC8,
	/**
	 * Write EGPRDPT
	 */
	DRV_ENCX24J600_SPI_INST_WGPRDPT = 0x60,
	/**
	 * Read EGPRDPT
	 */
	DRV_ENCX24J600_SPI_INST_RGPRDPT = 0x62,
	/**
	 * Write ERXRDPT
	 */
	DRV_ENCX24J600_SPI_INST_WRXRDPT = 0x64,
	/**
	 * Read ERXRDPT
	 */
	DRV_ENCX24J600_SPI_INST_RRXRDPT = 0x66,
	/**
	 * Write EUDARDPT
	 */
	DRV_ENCX24J600_SPI_INST_WUDARDPT = 0x68,
	/**
	 * Read EUDARDPT
	 */
	DRV_ENCX24J600_SPI_INST_RUDARDPT = 0x6A,
	/**
	 * Write EGPWRPT
	 */
	DRV_ENCX24J600_SPI_INST_WGPWRPT = 0x6C,
	/**
	 * Read EGPWRPT
	 */
	DRV_ENCX24J600_SPI_INST_RGPWRPT = 0x6E,
	/**
	 * Write ERXWRPT
	 */
	DRV_ENCX24J600_SPI_INST_WRXWRPT = 0x70,
	/**
	 * Read ERXWRPT
	 */
	DRV_ENCX24J600_SPI_INST_RRXWRPT = 0x72,
	/**
	 * Write EUDAWRPT
	 */
	DRV_ENCX24J600_SPI_INST_WUDAWRPT = 0x74,
	/**
	 * Read EUDAWRPT
	 */
	DRV_ENCX24J600_SPI_INST_RUDAWRPT = 0x76,
	/**
	 * Read Control Register
	 */
	DRV_ENCX24J600_SPI_INST_RCR = 0x00,
	/**
	 * Write Control Register
	 */
	DRV_ENCX24J600_SPI_INST_WCR = 0x40,
	/**
	 * Read Control Register Unbanked
	 */
	DRV_ENCX24J600_SPI_INST_RCRU = 0x20,
	/**
	 * Write Control Register Unbanked
	 */
	DRV_ENCX24J600_SPI_INST_WCRU = 0x22,
	/**
	 * Bit Field Set
	 */
	DRV_ENCX24J600_SPI_INST_BFS = 0x80,
	/**
	 * Bit Field Clear
	 */
	DRV_ENCX24J600_SPI_INST_BFC = 0xA0,
	/**
	 * Bit Field Set Unbanked
	 */
	DRV_ENCX24J600_SPI_INST_BFSU = 0x24,
	/**
	 * Bit Field Clear Unbanked
	 */
	DRV_ENCX24J600_SPI_INST_BFCU = 0x26,
	/**
	 * Read EGPDATA
	 */
	DRV_ENCX24J600_SPI_INST_RGPDATA = 0x28,
	/**
	 * Write EGPDATA
	 */
	DRV_ENCX24J600_SPI_INST_WGPDATA = 0x2A,
	/**
	 * Read ERXDATA
	 */
	DRV_ENCX24J600_SPI_INST_RRXDATA = 0x2C,
	/**
	 * Write ERXDATA
	 */
	DRV_ENCX24J600_SPI_INST_WRXDATA = 0x2E,
	/**
	 * Read EUDADATA
	 */
	DRV_ENCX24J600_SPI_INST_RUDADATA = 0x30,
	/**
	 * Write EUDADATA
	 */
	DRV_ENCX24J600_SPI_INST_WUDADATA = 0x32
} DRV_ENCX24J600_SPI_INST_SET;

