Microchip-MPLAB-Harmony/net/apps/tcpip_tcp_server_bridge/firmware/src/config/pic32mz_ef_sk_encx24j600/driver/encx24j600/src/dynamic/drv_encx24j600_ds_defs.h
typedef enum
{
	DRV_ENCX24J600_SPI_SFR_ETXST = 0x00,
	DRV_ENCX24J600_SPI_SFR_ETXLEN = 0x02,
	DRV_ENCX24J600_SPI_SFR_ERXST = 0x04,
	DRV_ENCX24J600_SPI_SFR_ERXTAIL = 0x06,
	DRV_ENCX24J600_SPI_SFR_ERXHEAD = 0x08,
	DRV_ENCX24J600_SPI_SFR_EDMAST = 0x0A,
	DRV_ENCX24J600_SPI_SFR_EDMALEN = 0x0C,
	DRV_ENCX24J600_SPI_SFR_EDMADST = 0x0E,
	DRV_ENCX24J600_SPI_SFR_EDMACS = 0x10,
	DRV_ENCX24J600_SPI_SFR_ETXSTAT = 0x12,
	DRV_ENCX24J600_SPI_SFR_ETXWIRE = 0x14,
	DRV_ENCX24J600_SPI_SFR_EUDAST = 0x16,
	DRV_ENCX24J600_SPI_SFR_EUDAND = 0x18,
	DRV_ENCX24J600_SPI_SFR_ESTAT = 0x1A,
	DRV_ENCX24J600_SPI_SFR_EIR = 0x1C,
	DRV_ENCX24J600_SPI_SFR_ECON1 = 0x1E,
	DRV_ENCX24J600_SPI_SFR_EHT1 = 0x20,
	DRV_ENCX24J600_SPI_SFR_EHT2 = 0x22,
	DRV_ENCX24J600_SPI_SFR_EHT3 = 0x24,
	DRV_ENCX24J600_SPI_SFR_EHT4 = 0x26,
	DRV_ENCX24J600_SPI_SFR_EPMM1 = 0x28,
	DRV_ENCX24J600_SPI_SFR_EPMM2 = 0x2A,
	DRV_ENCX24J600_SPI_SFR_EPMM3 = 0x2C,
	DRV_ENCX24J600_SPI_SFR_EPMM4 = 0x2E,
	DRV_ENCX24J600_SPI_SFR_EPMCS = 0x30,
	DRV_ENCX24J600_SPI_SFR_EPMO = 0x32,
	DRV_ENCX24J600_SPI_SFR_ERXFCON = 0x34,
	DRV_ENCX24J600_SPI_SFR_MACON1 = 0x40,
	DRV_ENCX24J600_SPI_SFR_MACON2 = 0x42,
	DRV_ENCX24J600_SPI_SFR_MABBIPG = 0x44,
	DRV_ENCX24J600_SPI_SFR_MAIPG = 0x46,
	DRV_ENCX24J600_SPI_SFR_MACLCON = 0x48,
	DRV_ENCX24J600_SPI_SFR_MAMXFL = 0x4A,
	DRV_ENCX24J600_SPI_SFR_MICMD = 0x52,
	DRV_ENCX24J600_SPI_SFR_MIREGADR = 0x54,
	DRV_ENCX24J600_SPI_SFR_MAADR3 = 0x60,
	DRV_ENCX24J600_SPI_SFR_MAADR2 = 0x62,
	DRV_ENCX24J600_SPI_SFR_MAADR1 = 0x64,
	DRV_ENCX24J600_SPI_SFR_MIWR = 0x66,
	DRV_ENCX24J600_SPI_SFR_MIRD = 0x68,
	DRV_ENCX24J600_SPI_SFR_MISTAT = 0x6A,
	DRV_ENCX24J600_SPI_SFR_EPAUS = 0x6C,
	DRV_ENCX24J600_SPI_SFR_ECON2 = 0x6E,
	DRV_ENCX24J600_SPI_SFR_ERXWM = 0x70,
	DRV_ENCX24J600_SPI_SFR_EIE = 0x72,
	DRV_ENCX24J600_SPI_SFR_EIDLED = 0x74,
	DRV_ENCX24J600_SPI_SFR_EGPDATA = 0x80,
	DRV_ENCX24J600_SPI_SFR_ERXDATA = 0x82,
	DRV_ENCX24J600_SPI_SFR_EUDADTA = 0x84,
	DRV_ENCX24J600_SPI_SFR_EGPRDPT = 0x86,
	DRV_ENCX24J600_SPI_SFR_EGPWRPT = 0x88,
	DRV_ENCX24J600_SPI_SFR_ERXRDPT = 0x8A,
	DRV_ENCX24J600_SPI_SFR_ERXWRPT = 0x8C,
	DRV_ENCX24J600_SPI_SFR_EUDARDPT = 0x8E,
	DRV_ENCX24J600_SPI_SFR_EUDAWRPT = 0x90
} DRV_ENCX24J600_SPI_SFR_MAP;


#ifdef __cplusplus
}
#endif


#endif /*!defined(MCHP_9AF9E982_4FC2_44a4_B2D8_34A7D80A51EA__INCLUDED_)*/
 
